[Killed] StringLiteral
sd-010-b-project-react-testing-library/src/components/Pokedex.js:12:51
 class Pokedex extends React.Component {
   constructor(props) {
     super(props);
-    this.state = { pokemonIndex: 0, filteredType: 'all' };
+    this.state = { pokemonIndex: 0, filteredType: "" };
   }
 

[Killed] StringLiteral
sd-010-b-project-react-testing-library/src/components/Pokedex.js:54:25
         </Button>
         {pokemonTypes.map((type) => (
           <Button
-            dataTestId={`pokemon-type-button`}
+            dataTestId={""}
             key={ type }
             onClick={ () => this.filterPokemons(type) }
